#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # google_compute_backend_service.backend_service[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_backend_service" "backend_service" {
      [32m+[0m [0m[1m[0mconnection_draining_timeout_sec[0m[0m = 300
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m                     = "Backend service contianing the Managed Instance Group"
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mhealth_checks[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mload_balancing_scheme[0m[0m           = "EXTERNAL"
      [32m+[0m [0m[1m[0mname[0m[0m                            = "assignment-terraform-dev-backend-service"
      [32m+[0m [0m[1m[0mport_name[0m[0m                       = "http"
      [32m+[0m [0m[1m[0mproject[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m                        = "HTTP"
      [32m+[0m [0m[1m[0mself_link[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0msession_affinity[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mtimeout_sec[0m[0m                     = 10

      [32m+[0m [0mbackend {
          [32m+[0m [0m[1m[0mbalancing_mode[0m[0m               = "UTILIZATION"
          [32m+[0m [0m[1m[0mcapacity_scaler[0m[0m              = 1
          [32m+[0m [0m[1m[0mgroup[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections_per_endpoint[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections_per_instance[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate_per_endpoint[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate_per_instance[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mmax_utilization[0m[0m              = (known after apply)
        }
      [32m+[0m [0mbackend {
          [32m+[0m [0m[1m[0mbalancing_mode[0m[0m               = "UTILIZATION"
          [32m+[0m [0m[1m[0mcapacity_scaler[0m[0m              = 1
          [32m+[0m [0m[1m[0mgroup[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections_per_endpoint[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections_per_instance[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate_per_endpoint[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate_per_instance[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mmax_utilization[0m[0m              = (known after apply)
        }

      [32m+[0m [0mcdn_policy {
          [32m+[0m [0m[1m[0mcache_mode[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mclient_ttl[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mdefault_ttl[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mmax_ttl[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mnegative_caching[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mserve_while_stale[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msigned_url_cache_max_age_sec[0m[0m = (known after apply)

          [32m+[0m [0mcache_key_policy {
              [32m+[0m [0m[1m[0minclude_host[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0minclude_named_cookies[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0minclude_protocol[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0minclude_query_string[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mquery_string_blacklist[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mquery_string_whitelist[0m[0m = (known after apply)
            }

          [32m+[0m [0mnegative_caching_policy {
              [32m+[0m [0m[1m[0mcode[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mttl[0m[0m  = (known after apply)
            }
        }

      [32m+[0m [0mlog_config {
          [32m+[0m [0m[1m[0menable[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0msample_rate[0m[0m = (known after apply)
        }
    }

[1m  # google_compute_firewall.allow_health_check[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_firewall" "allow_health_check" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m        = "Firewall to allow health checks on the MIG instances"
      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdirection[0m[0m          = "INGRESS"
      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "assignment-terraform-dev-health-check-firewall"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [
          [32m+[0m [0m"130.211.0.0/22",
          [32m+[0m [0m"35.191.0.0/16",
        ]
      [32m+[0m [0m[1m[0mtarget_tags[0m[0m        = [
          [32m+[0m [0m"allow-health-check",
        ]

      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"80",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"
        }
    }

[1m  # google_compute_global_address.global-address[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_global_address" "global-address" {
      [32m+[0m [0m[1m[0maddress[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m        = "Public IP address of the load balancer"
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "assignment-terraform-dev-global-address"
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
    }

[1m  # google_compute_global_forwarding_rule.forwarding-rule[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_global_forwarding_rule" "forwarding-rule" {
      [32m+[0m [0m[1m[0mdescription[0m[0m           = "Global external load balancer"
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mip_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mip_protocol[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mload_balancing_scheme[0m[0m = "EXTERNAL"
      [32m+[0m [0m[1m[0mname[0m[0m                  = "assignment-terraform-dev-forwarding-rule-port-8080"
      [32m+[0m [0m[1m[0mnetwork[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mport_range[0m[0m            = "80"
      [32m+[0m [0m[1m[0mproject[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mpsc_connection_id[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mpsc_connection_status[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mtarget[0m[0m                = (known after apply)
    }

[1m  # google_compute_health_check.autohealing[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_health_check" "autohealing" {
      [32m+[0m [0m[1m[0mcheck_interval_sec[0m[0m  = 10
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m         = "Autohealing http health check for the managed instance group"
      [32m+[0m [0m[1m[0mhealthy_threshold[0m[0m   = 1
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                = "assignment-terraform-dev-autohealing-health-check"
      [32m+[0m [0m[1m[0mproject[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mtimeout_sec[0m[0m         = 5
      [32m+[0m [0m[1m[0mtype[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0munhealthy_threshold[0m[0m = 3

      [32m+[0m [0mhttp_health_check {
          [32m+[0m [0m[1m[0mport[0m[0m         = 80
          [32m+[0m [0m[1m[0mproxy_header[0m[0m = "NONE"
          [32m+[0m [0m[1m[0mrequest_path[0m[0m = "/"
        }

      [32m+[0m [0mlog_config {
          [32m+[0m [0m[1m[0menable[0m[0m = (known after apply)
        }
    }

[1m  # google_compute_instance_template.web_server[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_instance_template" "web_server" {
      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m          = false
      [32m+[0m [0m[1m[0mdescription[0m[0m             = "This template is used to create a apache2 web server"
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0minstance_description[0m[0m    = "Instance running a apache2 web server"
      [32m+[0m [0m[1m[0mlabels[0m[0m                  = {
          [32m+[0m [0m"environment" = "dev"
        }
      [32m+[0m [0m[1m[0mmachine_type[0m[0m            = "e2-standard-2"
      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmetadata_startup_script[0m[0m = <<-EOT
                #!/bin/bash
                apt update 
                apt -y install apache2
                echo "Hello world from $(hostname) $(hostname -I)" > /var/www/html/index.html
        EOT
      [32m+[0m [0m[1m[0mname[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mname_prefix[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                    = [
          [32m+[0m [0m"allow-health-check",
        ]
      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m        = (known after apply)

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [32m+[0m [0mdisk {
          [32m+[0m [0m[1m[0mauto_delete[0m[0m  = true
          [32m+[0m [0m[1m[0mboot[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdisk_type[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0minterface[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0msource_image[0m[0m = "debian-cloud/debian-11"
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m = (known after apply)
        }

      [32m+[0m [0mscheduling {
          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0minstance_termination_action[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m          = (known after apply)

          [32m+[0m [0mnode_affinities {
              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
            }
        }

      [32m+[0m [0mservice_account {
          [32m+[0m [0m[1m[0memail[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mscopes[0m[0m = [
              [32m+[0m [0m"https://www.googleapis.com/auth/compute.readonly",
            ]
        }
    }

[1m  # google_compute_network.vpc_network[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_network" "vpc_network" {
      [32m+[0m [0m[1m[0mauto_create_subnetworks[0m[0m         = true
      [32m+[0m [0m[1m[0mdelete_default_routes_on_create[0m[0m = false
      [32m+[0m [0m[1m[0mdescription[0m[0m                     = "Virtual private network for the application"
      [32m+[0m [0m[1m[0mgateway_ipv4[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0minternal_ipv6_range[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mmtu[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                            = "assignment-terraform-dev-vpc"
      [32m+[0m [0m[1m[0mproject[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mrouting_mode[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                       = (known after apply)
    }

[1m  # google_compute_region_instance_group_manager.web_server_instance_group["europe-west4"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_region_instance_group_manager" "web_server_instance_group" {
      [32m+[0m [0m[1m[0mbase_instance_name[0m[0m               = "assignment-terraform-dev-nginx"
      [32m+[0m [0m[1m[0mdescription[0m[0m                      = "Managed instance group in a region distributed over multiple zones"
      [32m+[0m [0m[1m[0mdistribution_policy_target_shape[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdistribution_policy_zones[0m[0m        = [
          [32m+[0m [0m"europe-west4-a",
          [32m+[0m [0m"europe-west4-b",
          [32m+[0m [0m"europe-west4-c",
        ]
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0minstance_group[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                           = "europe-west4"
      [32m+[0m [0m[1m[0mself_link[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mtarget_size[0m[0m                      = 3
      [32m+[0m [0m[1m[0mwait_for_instances[0m[0m               = false
      [32m+[0m [0m[1m[0mwait_for_instances_status[0m[0m        = "STABLE"

      [32m+[0m [0mauto_healing_policies {
          [32m+[0m [0m[1m[0mhealth_check[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0minitial_delay_sec[0m[0m = 30
        }

      [32m+[0m [0mnamed_port {
          [32m+[0m [0m[1m[0mname[0m[0m = "http"
          [32m+[0m [0m[1m[0mport[0m[0m = 80
        }

      [32m+[0m [0mupdate_policy {
          [32m+[0m [0m[1m[0minstance_redistribution_type[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmax_surge_fixed[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mmax_surge_percent[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mmax_unavailable_fixed[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmax_unavailable_percent[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mminimal_action[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mmost_disruptive_allowed_action[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mreplacement_method[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m                           = (known after apply)
        }

      [32m+[0m [0mversion {
          [32m+[0m [0m[1m[0minstance_template[0m[0m = (known after apply)
        }
    }

[1m  # google_compute_region_instance_group_manager.web_server_instance_group["us-central1"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_region_instance_group_manager" "web_server_instance_group" {
      [32m+[0m [0m[1m[0mbase_instance_name[0m[0m               = "assignment-terraform-dev-nginx"
      [32m+[0m [0m[1m[0mdescription[0m[0m                      = "Managed instance group in a region distributed over multiple zones"
      [32m+[0m [0m[1m[0mdistribution_policy_target_shape[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdistribution_policy_zones[0m[0m        = [
          [32m+[0m [0m"us-central1-a",
          [32m+[0m [0m"us-central1-b",
          [32m+[0m [0m"us-central1-c",
        ]
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0minstance_group[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                           = "us-central1"
      [32m+[0m [0m[1m[0mself_link[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mtarget_size[0m[0m                      = 3
      [32m+[0m [0m[1m[0mwait_for_instances[0m[0m               = false
      [32m+[0m [0m[1m[0mwait_for_instances_status[0m[0m        = "STABLE"

      [32m+[0m [0mauto_healing_policies {
          [32m+[0m [0m[1m[0mhealth_check[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0minitial_delay_sec[0m[0m = 30
        }

      [32m+[0m [0mnamed_port {
          [32m+[0m [0m[1m[0mname[0m[0m = "http"
          [32m+[0m [0m[1m[0mport[0m[0m = 80
        }

      [32m+[0m [0mupdate_policy {
          [32m+[0m [0m[1m[0minstance_redistribution_type[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmax_surge_fixed[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mmax_surge_percent[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mmax_unavailable_fixed[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmax_unavailable_percent[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mminimal_action[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mmost_disruptive_allowed_action[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mreplacement_method[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m                           = (known after apply)
        }

      [32m+[0m [0mversion {
          [32m+[0m [0m[1m[0minstance_template[0m[0m = (known after apply)
        }
    }

[1m  # google_compute_router.router["europe-west4"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_router" "router" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m        = "Network router for each region in the VPC"
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "assignment-terraform-dev-router"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m             = "europe-west4"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
    }

[1m  # google_compute_router.router["us-central1"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_router" "router" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m        = "Network router for each region in the VPC"
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "assignment-terraform-dev-router"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m             = "us-central1"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
    }

[1m  # google_compute_router_nat.nat["europe-west4"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_router_nat" "nat" {
      [32m+[0m [0m[1m[0menable_dynamic_port_allocation[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0menable_endpoint_independent_mapping[0m[0m = true
      [32m+[0m [0m[1m[0micmp_idle_timeout_sec[0m[0m               = 30
      [32m+[0m [0m[1m[0mid[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                = "assignment-terraform-dev-nat"
      [32m+[0m [0m[1m[0mnat_ip_allocate_option[0m[0m              = "AUTO_ONLY"
      [32m+[0m [0m[1m[0mproject[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                              = "europe-west4"
      [32m+[0m [0m[1m[0mrouter[0m[0m                              = "assignment-terraform-dev-router"
      [32m+[0m [0m[1m[0msource_subnetwork_ip_ranges_to_nat[0m[0m  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      [32m+[0m [0m[1m[0mtcp_established_idle_timeout_sec[0m[0m    = 1200
      [32m+[0m [0m[1m[0mtcp_transitory_idle_timeout_sec[0m[0m     = 30
      [32m+[0m [0m[1m[0mudp_idle_timeout_sec[0m[0m                = 30
    }

[1m  # google_compute_router_nat.nat["us-central1"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_router_nat" "nat" {
      [32m+[0m [0m[1m[0menable_dynamic_port_allocation[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0menable_endpoint_independent_mapping[0m[0m = true
      [32m+[0m [0m[1m[0micmp_idle_timeout_sec[0m[0m               = 30
      [32m+[0m [0m[1m[0mid[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                = "assignment-terraform-dev-nat"
      [32m+[0m [0m[1m[0mnat_ip_allocate_option[0m[0m              = "AUTO_ONLY"
      [32m+[0m [0m[1m[0mproject[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                              = "us-central1"
      [32m+[0m [0m[1m[0mrouter[0m[0m                              = "assignment-terraform-dev-router"
      [32m+[0m [0m[1m[0msource_subnetwork_ip_ranges_to_nat[0m[0m  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      [32m+[0m [0m[1m[0mtcp_established_idle_timeout_sec[0m[0m    = 1200
      [32m+[0m [0m[1m[0mtcp_transitory_idle_timeout_sec[0m[0m     = 30
      [32m+[0m [0m[1m[0mudp_idle_timeout_sec[0m[0m                = 30
    }

[1m  # google_compute_subnetwork.vpc_subnet["europe-west4"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "vpc_subnet" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m                = "Subent for each region in the VPC"
      [32m+[0m [0m[1m[0mexternal_ipv6_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mgateway_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mip_cidr_range[0m[0m              = "172.16.0.0/24"
      [32m+[0m [0m[1m[0mipv6_cidr_range[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "assignment-terraform-dev-subnet-europe-west4"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mpurpose[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                     = "europe-west4"
      [32m+[0m [0m[1m[0msecondary_ip_range[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mstack_type[0m[0m                 = (known after apply)
    }

[1m  # google_compute_subnetwork.vpc_subnet["us-central1"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "vpc_subnet" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m                = "Subent for each region in the VPC"
      [32m+[0m [0m[1m[0mexternal_ipv6_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mgateway_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mip_cidr_range[0m[0m              = "172.16.1.0/24"
      [32m+[0m [0m[1m[0mipv6_cidr_range[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "assignment-terraform-dev-subnet-us-central1"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mpurpose[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                     = "us-central1"
      [32m+[0m [0m[1m[0msecondary_ip_range[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mstack_type[0m[0m                 = (known after apply)
    }

[1m  # google_compute_target_http_proxy.webserver_proxy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_target_http_proxy" "webserver_proxy" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m        = "Proxy mapping for the Load balancer"
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "assignment-terraform-dev-webserver-proxy"
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mproxy_bind[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproxy_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0murl_map[0m[0m            = (known after apply)
    }

[1m  # google_compute_url_map.url_map[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_url_map" "url_map" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdefault_service[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m        = "Url mapping to the backend services"
      [32m+[0m [0m[1m[0mfingerprint[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mmap_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "assignment-terraform-dev-url-map"
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
    }

[1m  # google_project_iam_binding.mig_roles["roles/iam.serviceAccountUser"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_project_iam_binding" "mig_roles" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmembers[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = "playground-daan"
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/iam.serviceAccountUser"
    }

[1m  # google_service_account.instance_service_account[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_service_account" "instance_service_account" {
      [32m+[0m [0m[1m[0maccount_id[0m[0m   = "assignment-terraform-dev-mig"
      [32m+[0m [0m[1m[0mdescription[0m[0m  = "Service account attached to the MIG instances"
      [32m+[0m [0m[1m[0mdisabled[0m[0m     = false
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = "Service Account used for the managed instance groups"
      [32m+[0m [0m[1m[0memail[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m      = "playground-daan"
      [32m+[0m [0m[1m[0munique_id[0m[0m    = (known after apply)
    }

[1m  # random_id.instance_template_suffix[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_id" "instance_template_suffix" {
      [32m+[0m [0m[1m[0mb64_std[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mb64_url[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mbyte_length[0m[0m = 6
      [32m+[0m [0m[1m[0mdec[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mhex[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
    }

[0m[1mPlan:[0m 20 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @DanielRieske, Action: `pull_request`*